# encoding:utf-8
import pandas as pd


def way():
    # "Bug编号","所属产品","所属模块","所属项目","相关需求","相关任务",
    # "Bug标题","关键词","严重程度","优先级","Bug类型","操作系统","浏览器","
    # 重现步骤","Bug状态","截止日期","激活次数","是否确认","抄送给","由谁创建","
    # 创建日期","影响版本","指派给","指派日期","解决者","解决方案","解决版本","
    # 解决日期","由谁关闭","关闭日期","重复ID","相关Bug","相关用例",
    # "最后修改者","修改日期","附件"
    # 对于没有头的文件，将header设置成none，会自动生成头
    data = pd.read_csv("./1.csv", encoding="gbk", header=None)
    # 设置columns
    data.columns = [u"Bug编号", u"所属产品", u"所属模块", u"所属项目", u"相关需求", u"相关任务", u"Bug标题", u"关键词", u"严重程度", u"优先级", u"Bug类型",
                    u"操作系统", u"浏览器", u"重现步骤", u"Bug状态", u"截止日期", u"激活次数", u"是否确认", u"抄送给", u"由谁创建", u"创建日期", u"影响版本",
                    u"指派给", u"指派日期", u"解决者", u"解决方案", u"解决版本", u"解决日期", u"由谁关闭", u"关闭日期", u"重复ID", u"相关Bug", u"相关用例",
                    u"最后修改者", u"修改日期", u"附件", u"附件"]
    data.set_index(u"Bug编号",inplace=True)
    print(data)
    data.to_excel("./3.xlsx")
    print("OK")


if __name__ == '__main__':
    way()
